
<?php
/*
|--------------------------------------------------------------------------
| 注册自动加载程序
|--------------------------------------------------------------------------
|
| 引入 Composer 自动加载器和数据库类
|
*/

require __DIR__.'/../vendor/autoload.php';


/*
|--------------------------------------------------------------------------
| 环境检查
|--------------------------------------------------------------------------
*/

if (!file_exists(__DIR__.'/../conf/install.lock')) {
    require __DIR__.'/../app/setup/chkenv.php';
}


if (array_key_exists('key', $_GET)) {
    require __DIR__.'/../app/bootstrap.php';
    exit();
} else {
    require __DIR__.'/../app/bootstrap.php';
}




